// node-practice/math-utils.js

// TODO: Создай и экспортируй следующие функции:

// 1. add(a, b) - сложение
// 2. subtract(a, b) - вычитание
// 3. multiply(a, b) - умножение
// 4. divide(a, b) - деление (проверять деление на ноль!)
// 5. power(base, exponent) - возведение в степень
// 6. circleArea(radius) - площадь круга (используй Math.PI)
// 7. PRIVATE_VARIABLE = "Я невидима снаружи" (не экспортировать!)

// Экспортируй функции через именованный экспорт

// Также создай экспорт по умолчанию - объект со всеми функциями

export const add = (a, b)=> {
    return a + b
} 